In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from config import username, password
from numpy.random import seed
seed(42)
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler
import tensorflow
tensorflow.keras.__version__
import warnings
warnings.filterwarnings('ignore')

C:\Users\jagno\.conda\envs\PythonData\lib\site-packages\tensorflow\python\framework\dtypes.py:516: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_qint8 = np.dtype([("qint8", np.int8, 1)])
C:\Users\jagno\.conda\envs\PythonData\lib\site-packages\tensorflow\python\framework\dtypes.py:517: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_quint8 = np.dtype([("quint8", np.uint8, 1)])
C:\Users\jagno\.conda\envs\PythonData\lib\site-packages\tensorflow\python\framework\dtypes.py:518: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_qint16 = np.dtype([("qint16", np.int16, 1)])
C:\Users\jagno\.conda\envs\PythonData\lib\site-packages\tensorflow\python\framework\dtypes.py:519: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_quint16 = np.dtype([("quint16", np.uint16, 1)])
C:\Users\jagno\.conda\envs\PythonData\lib\site-packages\tensorflow\python\framework\dtypes.py:520: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_qint32 = np.dtype([("qint32", np.int32, 1)])
C:\Users\jagno\.conda\envs\PythonData\lib\site-packages\tensorflow\python\framework\dtypes.py:525: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  np_resource = np.dtype([("resource", np.ubyte, 1)])
C:\Users\jagno\.conda\envs\PythonData\lib\site-packages\tensorboard\compat\tensorflow_stub\dtypes.py:541: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_qint8 = np.dtype([("qint8", np.int8, 1)])
C:\Users\jagno\.conda\envs\PythonData\lib\site-packages\tensorboard\compat\tensorflow_stub\dtypes.py:542: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_quint8 = np.dtype([("quint8", np.uint8, 1)])
C:\Users\jagno\.conda\envs\PythonData\lib\site-packages\tensorboard\compat\tensorflow_stub\dtypes.py:543: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_qint16 = np.dtype([("qint16", np.int16, 1)])
C:\Users\jagno\.conda\envs\PythonData\lib\site-packages\tensorboard\compat\tensorflow_stub\dtypes.py:544: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_quint16 = np.dtype([("quint16", np.uint16, 1)])
C:\Users\jagno\.conda\envs\PythonData\lib\site-packages\tensorboard\compat\tensorflow_stub\dtypes.py:545: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_qint32 = np.dtype([("qint32", np.int32, 1)])
C:\Users\jagno\.conda\envs\PythonData\lib\site-packages\tensorboard\compat\tensorflow_stub\dtypes.py:550: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  np_resource = np.dtype([("resource", np.ubyte, 1)])

In [2]:
# reading in ratings csv files
ratings_df = pd.read_csv("./Resources/IMDB_ratings.csv")
ratings_df.head()

,imdb_title_id,weighted_average_vote,total_votes,mean_vote,median_vote,votes_10,votes_9,votes_8,votes_7,votes_6,...,females_30age_avg_vote,females_30age_votes,females_45age_avg_vote,females_45age_votes,top1000_voters_rating,top1000_voters_votes,us_voters_rating,us_voters_votes,non_us_voters_rating,non_us_voters_votes
0,tt0000574,6.1,537,6.3,6.0,54,17,55,121,122,...,6.0,19.0,6.6,14.0,6.3,64.0,6.0,89.0,6.2,309.0
1,tt0001892,5.9,171,6.1,6.0,5,6,17,41,52,...,5.8,4.0,6.5,8.0,5.9,29.0,6.2,27.0,6.0,114.0
2,tt0002101,5.2,420,5.2,5.0,12,8,16,60,89,...,5.5,14.0,6.2,20.0,4.9,57.0,5.5,197.0,4.7,103.0
3,tt0002130,7.0,2019,6.9,7.0,194,208,386,571,308,...,7.3,74.0,7.4,75.0,7.0,126.0,7.1,452.0,7.0,1076.0
4,tt0002199,5.7,438,5.8,6.0,28,15,42,75,114,...,4.8,10.0,6.5,15.0,5.7,56.0,5.9,161.0,5.7,164.0

In [3]:
# Read in movies csv
movies_df = pd.read_csv("./Resources/IMDB_movies.csv")
movies_df.head(1)

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0

In [4]:
# Remove extra columns
movies_df = movies_df[["imdb_title_id", "title", "year", "genre", "duration", "country", "director", "production_company", "budget"]]
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81273 entries, 0 to 81272
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   imdb_title_id       81273 non-null  object
 1   title               81273 non-null  object
 2   year                81273 non-null  int64
 3   genre               81273 non-null  object
 4   duration            81273 non-null  int64
 5   country             81234 non-null  object
 6   director            81200 non-null  object
 7   production_company  76948 non-null  object
 8   budget              22804 non-null  object
dtypes: int64(2), object(7)
memory usage: 5.6+ MB

In [5]:
# Drop nulls
movies_df_clean = movies_df.dropna(how="any")
movies_df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22206 entries, 0 to 81270
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   imdb_title_id       22206 non-null  object
 1   title               22206 non-null  object
 2   year                22206 non-null  int64
 3   genre               22206 non-null  object
 4   duration            22206 non-null  int64
 5   country             22206 non-null  object
 6   director            22206 non-null  object
 7   production_company  22206 non-null  object
 8   budget              22206 non-null  object
dtypes: int64(2), object(7)
memory usage: 1.7+ MB

In [6]:
# Filter to movies from USA
movies_df_clean = movies_df_clean.loc[(movies_df_clean["country"] == "USA")]
movies_df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10022 entries, 2 to 81254
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   imdb_title_id       10022 non-null  object
 1   title               10022 non-null  object
 2   year                10022 non-null  int64
 3   genre               10022 non-null  object
 4   duration            10022 non-null  int64
 5   country             10022 non-null  object
 6   director            10022 non-null  object
 7   production_company  10022 non-null  object
 8   budget              10022 non-null  object
dtypes: int64(2), object(7)
memory usage: 783.0+ KB

In [7]:
# Filter movies from 2000 and on
movies_df_clean = movies_df_clean.loc[(movies_df_clean["year"] >= 2000)]
movies_df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5230 entries, 4115 to 81254
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   imdb_title_id       5230 non-null   object
 1   title               5230 non-null   object
 2   year                5230 non-null   int64
 3   genre               5230 non-null   object
 4   duration            5230 non-null   int64
 5   country             5230 non-null   object
 6   director            5230 non-null   object
 7   production_company  5230 non-null   object
 8   budget              5230 non-null   object
dtypes: int64(2), object(7)
memory usage: 408.6+ KB

In [8]:
movies_df_clean.head()

,imdb_title_id,title,year,genre,duration,country,director,production_company,budget
4115,tt0035423,Kate & Leopold,2001,"Comedy, Fantasy, Romance",118,USA,James Mangold,Konrad Pictures,$ 48000000
21096,tt0088751,The Naked Monster,2005,"Comedy, Horror, Sci-Fi",100,USA,"Wayne Berwick, Ted Newsom",Heidelberg Films,PYG 350000000
28059,tt0113026,The Fantasticks,2000,"Musical, Romance",86,USA,Michael Ritchie,Michael Ritchie Productions,$ 10000000
29517,tt0118589,Glitter,2001,"Drama, Music, Romance",104,USA,Vondie Curtis-Hall,Twentieth Century Fox,$ 22000000
29544,tt0118652,The Attic Expeditions,2001,"Comedy, Horror, Mystery",100,USA,Jeremy Kasten,Tse Tse Fly Productions,$ 1000000

In [9]:
# Split budget column on currency type
movies_df_clean[["currency", "budget"]] = movies_df_clean['budget'].str.split(' ', expand= True)
movies_df_clean.head()

,imdb_title_id,title,year,genre,duration,country,director,production_company,budget,currency
4115,tt0035423,Kate & Leopold,2001,"Comedy, Fantasy, Romance",118,USA,James Mangold,Konrad Pictures,48000000,$
21096,tt0088751,The Naked Monster,2005,"Comedy, Horror, Sci-Fi",100,USA,"Wayne Berwick, Ted Newsom",Heidelberg Films,350000000,PYG
28059,tt0113026,The Fantasticks,2000,"Musical, Romance",86,USA,Michael Ritchie,Michael Ritchie Productions,10000000,$
29517,tt0118589,Glitter,2001,"Drama, Music, Romance",104,USA,Vondie Curtis-Hall,Twentieth Century Fox,22000000,$
29544,tt0118652,The Attic Expeditions,2001,"Comedy, Horror, Mystery",100,USA,Jeremy Kasten,Tse Tse Fly Productions,1000000,$

In [10]:
# Remove columns that don't have $ as currency
movies_df_final = movies_df_clean.loc[(movies_df_clean["currency"] == "$")]
movies_df_final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5222 entries, 4115 to 81254
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   imdb_title_id       5222 non-null   object
 1   title               5222 non-null   object
 2   year                5222 non-null   int64
 3   genre               5222 non-null   object
 4   duration            5222 non-null   int64
 5   country             5222 non-null   object
 6   director            5222 non-null   object
 7   production_company  5222 non-null   object
 8   budget              5222 non-null   object
 9   currency            5222 non-null   object
dtypes: int64(2), object(8)
memory usage: 448.8+ KB

In [11]:
# Setting budget to integer data type
movies_df_final["budget"] = movies_df_final["budget"].astype(int)
movies_df_final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5222 entries, 4115 to 81254
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   imdb_title_id       5222 non-null   object
 1   title               5222 non-null   object
 2   year                5222 non-null   int64
 3   genre               5222 non-null   object
 4   duration            5222 non-null   int64
 5   country             5222 non-null   object
 6   director            5222 non-null   object
 7   production_company  5222 non-null   object
 8   budget              5222 non-null   int32
 9   currency            5222 non-null   object
dtypes: int32(1), int64(2), object(7)
memory usage: 428.4+ KB

In [12]:
# Drop currency column
movies_df_final = movies_df_final.drop(["currency"], axis=1)
movies_df_final.head()

,imdb_title_id,title,year,genre,duration,country,director,production_company,budget
4115,tt0035423,Kate & Leopold,2001,"Comedy, Fantasy, Romance",118,USA,James Mangold,Konrad Pictures,48000000
28059,tt0113026,The Fantasticks,2000,"Musical, Romance",86,USA,Michael Ritchie,Michael Ritchie Productions,10000000
29517,tt0118589,Glitter,2001,"Drama, Music, Romance",104,USA,Vondie Curtis-Hall,Twentieth Century Fox,22000000
29544,tt0118652,The Attic Expeditions,2001,"Comedy, Horror, Mystery",100,USA,Jeremy Kasten,Tse Tse Fly Productions,1000000
29576,tt0118710,Beyond the Pale,2000,Drama,96,USA,George Bazala,i4i Productions,180000

In [13]:
# create and view ratings dataframe
ratings_df = ratings_df[["imdb_title_id", "total_votes", "median_vote", "allgenders_18age_avg_vote", "allgenders_30age_avg_vote", "allgenders_45age_avg_vote", "males_allages_avg_vote", "males_18age_avg_vote", "males_30age_avg_vote", "males_45age_avg_vote", "females_allages_avg_vote", "females_18age_avg_vote", "females_30age_avg_vote", "females_45age_avg_vote"]]
ratings_df.head()

,imdb_title_id,total_votes,median_vote,allgenders_18age_avg_vote,allgenders_30age_avg_vote,allgenders_45age_avg_vote,males_allages_avg_vote,males_18age_avg_vote,males_30age_avg_vote,males_45age_avg_vote,females_allages_avg_vote,females_18age_avg_vote,females_30age_avg_vote,females_45age_avg_vote
0,tt0000574,537,6.0,6.2,5.9,6.4,6.1,6.2,5.9,6.4,6.1,5.7,6.0,6.6
1,tt0001892,171,6.0,5.7,6.0,6.3,6.0,5.8,6.0,6.3,5.7,5.8,5.8,6.5
2,tt0002101,420,5.0,4.6,5.1,5.3,5.0,4.6,5.1,5.2,5.8,4.5,5.5,6.2
3,tt0002130,2019,7.0,7.0,7.0,7.1,7.0,7.0,7.0,7.0,7.2,6.8,7.3,7.4
4,tt0002199,438,6.0,5.7,5.6,5.9,5.8,5.8,5.7,5.8,5.4,5.0,4.8,6.5

In [14]:
# rename name columns for cleaner view
ratings_df = ratings_df.rename(columns={"allgenders_18age_avg_vote":"all18to29", "allgenders_30age_avg_vote":"all30to44", "allgenders_45age_avg_vote":"allover45", "males_allages_avg_vote":"males", "males_18age_avg_vote":"males18to29", "males_30age_avg_vote":"males30to44", "males_45age_avg_vote":"malesover45", "females_allages_avg_vote":"females", "females_18age_avg_vote":"females18to29", "females_30age_avg_vote":"females30to44", "females_45age_avg_vote":"femalesover45"})
ratings_df.head()

,imdb_title_id,total_votes,median_vote,all18to29,all30to44,allover45,males,males18to29,males30to44,malesover45,females,females18to29,females30to44,femalesover45
0,tt0000574,537,6.0,6.2,5.9,6.4,6.1,6.2,5.9,6.4,6.1,5.7,6.0,6.6
1,tt0001892,171,6.0,5.7,6.0,6.3,6.0,5.8,6.0,6.3,5.7,5.8,5.8,6.5
2,tt0002101,420,5.0,4.6,5.1,5.3,5.0,4.6,5.1,5.2,5.8,4.5,5.5,6.2
3,tt0002130,2019,7.0,7.0,7.0,7.1,7.0,7.0,7.0,7.0,7.2,6.8,7.3,7.4
4,tt0002199,438,6.0,5.7,5.6,5.9,5.8,5.8,5.7,5.8,5.4,5.0,4.8,6.5

In [15]:
ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81273 entries, 0 to 81272
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_title_id  81273 non-null  object
 1   total_votes    81273 non-null  int64
 2   median_vote    81273 non-null  float64
 3   all18to29      80858 non-null  float64
 4   all30to44      81264 non-null  float64
 5   allover45      81160 non-null  float64
 6   males          81272 non-null  float64
 7   males18to29    80217 non-null  float64
 8   males30to44    81264 non-null  float64
 9   malesover45    81120 non-null  float64
 10  females        81203 non-null  float64
 11  females18to29  76239 non-null  float64
 12  females30to44  80409 non-null  float64
 13  femalesover45  78701 non-null  float64
dtypes: float64(12), int64(1), object(1)
memory usage: 8.7+ MB

In [16]:
# dropping null values for all columns
ratings_df = ratings_df.dropna(how="any")
ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 73056 entries, 0 to 81268
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_title_id  73056 non-null  object
 1   total_votes    73056 non-null  int64
 2   median_vote    73056 non-null  float64
 3   all18to29      73056 non-null  float64
 4   all30to44      73056 non-null  float64
 5   allover45      73056 non-null  float64
 6   males          73056 non-null  float64
 7   males18to29    73056 non-null  float64
 8   males30to44    73056 non-null  float64
 9   malesover45    73056 non-null  float64
 10  females        73056 non-null  float64
 11  females18to29  73056 non-null  float64
 12  females30to44  73056 non-null  float64
 13  femalesover45  73056 non-null  float64
dtypes: float64(12), int64(1), object(1)
memory usage: 8.4+ MB

In [17]:
# merge movies and ratings dataframes for complete database
clean_movies = pd.merge(movies_df_final, ratings_df, on = "imdb_title_id", how = "inner")
clean_movies.head()

,imdb_title_id,title,year,genre,duration,country,director,production_company,budget,total_votes,...,all30to44,allover45,males,males18to29,males30to44,malesover45,females,females18to29,females30to44,femalesover45
0,tt0035423,Kate & Leopold,2001,"Comedy, Fantasy, Romance",118,USA,James Mangold,Konrad Pictures,48000000,75298,...,6.3,6.4,6.3,6.5,6.2,6.3,6.6,6.7,6.4,6.7
1,tt0113026,The Fantasticks,2000,"Musical, Romance",86,USA,Michael Ritchie,Michael Ritchie Productions,10000000,1082,...,5.5,5.4,5.3,5.4,5.4,5.3,5.7,5.6,5.8,5.6
2,tt0118589,Glitter,2001,"Drama, Music, Romance",104,USA,Vondie Curtis-Hall,Twentieth Century Fox,22000000,20959,...,2.1,2.1,1.9,2.1,1.9,2.0,2.9,3.2,2.7,2.5
3,tt0118652,The Attic Expeditions,2001,"Comedy, Horror, Mystery",100,USA,Jeremy Kasten,Tse Tse Fly Productions,1000000,1588,...,5.1,4.6,5.0,4.7,5.1,4.6,4.8,5.8,4.6,4.6
4,tt0120467,Vulgar,2000,"Crime, Drama, Thriller",87,USA,Bryan Johnson,Chango Productions,120000,3852,...,5.3,5.0,5.3,6.1,5.3,5.1,5.2,5.2,5.3,4.6

In [18]:
# cleaning genre column so each movie falls under one genre
clean_movies["genre"] = clean_movies["genre"].str.split(",", expand=True)[0]
clean_movies.head()

,imdb_title_id,title,year,genre,duration,country,director,production_company,budget,total_votes,...,all30to44,allover45,males,males18to29,males30to44,malesover45,females,females18to29,females30to44,femalesover45
0,tt0035423,Kate & Leopold,2001,Comedy,118,USA,James Mangold,Konrad Pictures,48000000,75298,...,6.3,6.4,6.3,6.5,6.2,6.3,6.6,6.7,6.4,6.7
1,tt0113026,The Fantasticks,2000,Musical,86,USA,Michael Ritchie,Michael Ritchie Productions,10000000,1082,...,5.5,5.4,5.3,5.4,5.4,5.3,5.7,5.6,5.8,5.6
2,tt0118589,Glitter,2001,Drama,104,USA,Vondie Curtis-Hall,Twentieth Century Fox,22000000,20959,...,2.1,2.1,1.9,2.1,1.9,2.0,2.9,3.2,2.7,2.5
3,tt0118652,The Attic Expeditions,2001,Comedy,100,USA,Jeremy Kasten,Tse Tse Fly Productions,1000000,1588,...,5.1,4.6,5.0,4.7,5.1,4.6,4.8,5.8,4.6,4.6
4,tt0120467,Vulgar,2000,Crime,87,USA,Bryan Johnson,Chango Productions,120000,3852,...,5.3,5.0,5.3,6.1,5.3,5.1,5.2,5.2,5.3,4.6

In [19]:
# Get count of unique directors
clean_movies["director"].value_counts()

Steven Soderbergh             16
Clint Eastwood                14
Tyler Perry                   14
David Gordon Green            11
David DeCoteau                11
                              ..
Matt L. Lockhart               1
Jonathan Baker, Josh Baker     1
Bruce Leddy                    1
Robert Adetuyi                 1
Vondie Curtis-Hall             1
Name: director, Length: 3575, dtype: int64

In [20]:
# Split director column to get first name only
clean_movies["director"] = clean_movies["director"].str.split(',', expand= True)[0]
clean_movies.head()

,imdb_title_id,title,year,genre,duration,country,director,production_company,budget,total_votes,...,all30to44,allover45,males,males18to29,males30to44,malesover45,females,females18to29,females30to44,femalesover45
0,tt0035423,Kate & Leopold,2001,Comedy,118,USA,James Mangold,Konrad Pictures,48000000,75298,...,6.3,6.4,6.3,6.5,6.2,6.3,6.6,6.7,6.4,6.7
1,tt0113026,The Fantasticks,2000,Musical,86,USA,Michael Ritchie,Michael Ritchie Productions,10000000,1082,...,5.5,5.4,5.3,5.4,5.4,5.3,5.7,5.6,5.8,5.6
2,tt0118589,Glitter,2001,Drama,104,USA,Vondie Curtis-Hall,Twentieth Century Fox,22000000,20959,...,2.1,2.1,1.9,2.1,1.9,2.0,2.9,3.2,2.7,2.5
3,tt0118652,The Attic Expeditions,2001,Comedy,100,USA,Jeremy Kasten,Tse Tse Fly Productions,1000000,1588,...,5.1,4.6,5.0,4.7,5.1,4.6,4.8,5.8,4.6,4.6
4,tt0120467,Vulgar,2000,Crime,87,USA,Bryan Johnson,Chango Productions,120000,3852,...,5.3,5.0,5.3,6.1,5.3,5.1,5.2,5.2,5.3,4.6

In [21]:
# Recheck unique director count
clean_movies.director.value_counts()

Steven Soderbergh     16
Clint Eastwood        14
Tyler Perry           14
David Gordon Green    11
David DeCoteau        11
                      ..
Edward L. Plumb        1
Steve Stark            1
Jennifer Kirabo        1
Christine Parker       1
William Clift          1
Name: director, Length: 3516, dtype: int64

In [22]:
clean_movies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5060 entries, 0 to 5059
Data columns (total 22 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   imdb_title_id       5060 non-null   object
 1   title               5060 non-null   object
 2   year                5060 non-null   int64
 3   genre               5060 non-null   object
 4   duration            5060 non-null   int64
 5   country             5060 non-null   object
 6   director            5060 non-null   object
 7   production_company  5060 non-null   object
 8   budget              5060 non-null   int32
 9   total_votes         5060 non-null   int64
 10  median_vote         5060 non-null   float64
 11  all18to29           5060 non-null   float64
 12  all30to44           5060 non-null   float64
 13  allover45           5060 non-null   float64
 14  males               5060 non-null   float64
 15  males18to29         5060 non-null   float64
 16  males30to44         5060 non-null   float64
 17  malesover45         5060 non-null   float64
 18  females             5060 non-null   float64
 19  females18to29       5060 non-null   float64
 20  females30to44       5060 non-null   float64
 21  femalesover45       5060 non-null   float64
dtypes: float64(12), int32(1), int64(3), object(6)
memory usage: 889.5+ KB

In [23]:
clean_movies.median_vote.value_counts()

6.0     1274
7.0     1246
5.0      769
4.0      463
8.0      455
3.0      324
2.0      188
9.0      142
1.0       97
10.0      65
5.5        8
6.5        6
7.5        5
3.5        5
4.5        5
2.5        3
9.5        2
8.5        2
1.5        1
Name: median_vote, dtype: int64

In [24]:
# Create categories for movie ratings
conditions = [
    (clean_movies["median_vote"] <= 4),
    (clean_movies["median_vote"] > 4) & (clean_movies["median_vote"] < 8),
    (clean_movies["median_vote"] >= 8)
]

In [25]:
# Create list of values to assign to each condition
values = ["Bad", "Good", "Excellent"]

In [26]:
# Create new column using np.select
clean_movies["rating_class"] = np.select(conditions, values)
clean_movies[["median_vote", "rating_class"]].head()

   median_vote rating_class
0          7.0         Good
1          6.0         Good
2          1.0          Bad
3          5.0         Good
4          6.0         Good

In [27]:
clean_movies["rating_class"].value_counts()

Good         3313
Bad          1081
Excellent     666
Name: rating_class, dtype: int64

In [28]:
# Export clean file to .csv 
clean_movies.to_csv("./Resources/imdb_final.csv", index=False, header=True)

In [29]:
from prettytable import PrettyTable
x = PrettyTable()

In [30]:
csv = pd.read_csv("./Resources/imdb_final.csv")
x = csv
print(x)

     imdb_title_id                  title  year    genre  duration country  \
0        tt0035423         Kate & Leopold  2001   Comedy       118     USA
1        tt0113026        The Fantasticks  2000  Musical        86     USA
2        tt0118589                Glitter  2001    Drama       104     USA
3        tt0118652  The Attic Expeditions  2001   Comedy       100     USA
4        tt0120467                 Vulgar  2000    Crime        87     USA
...            ...                    ...   ...      ...       ...     ...
5055     tt9354944                   Jexi  2019   Comedy        84     USA
5056     tt9626278               Fourteen  2019    Drama        94     USA
5057     tt9670282             Zoombies 2  2019   Action        84     USA
5058     tt9815714           The Hard Way  2019   Action        92     USA
5059     tt9860860          Abduction 101  2019   Horror        77     USA

                director              production_company    budget  \
0          James Mangold                 Konrad Pictures  48000000
1        Michael Ritchie     Michael Ritchie Productions  10000000
2     Vondie Curtis-Hall           Twentieth Century Fox  22000000
3          Jeremy Kasten         Tse Tse Fly Productions   1000000
4          Bryan Johnson              Chango Productions    120000
...                  ...                             ...       ...
5055           Jon Lucas                       CBS Films   5000000
5056         Dan Sallitt                   Static Prods.     95000
5057        Glenn Miller  Slightly Distorted Productions    100000
5058        Keoni Waxman            Actionhouse Pictures   3000000
5059    Robin Entreinger                     Seven Light    500000

      total_votes  ...  allover45  males  males18to29  males30to44  \
0           75298  ...        6.4    6.3          6.5          6.2
1            1082  ...        5.4    5.3          5.4          5.4
2           20959  ...        2.1    1.9          2.1          1.9
3            1588  ...        4.6    5.0          4.7          5.1
4            3852  ...        5.0    5.3          6.1          5.3
...           ...  ...        ...    ...          ...          ...
5055         3674  ...        5.7    5.7          5.6          5.8
5056          149  ...        7.2    6.9          7.1          7.0
5057          227  ...        3.8    3.3          2.0          3.4
5058         1734  ...        4.8    4.7          4.8          4.7
5059          146  ...        2.8    2.3          1.6          2.3

      malesover45  females  females18to29  females30to44  femalesover45  \
0             6.3      6.6            6.7            6.4            6.7
1             5.3      5.7            5.6            5.8            5.6
2             2.0      2.9            3.2            2.7            2.5
3             4.6      4.8            5.8            4.6            4.6
4             5.1      5.2            5.2            5.3            4.6
...           ...      ...            ...            ...            ...
5055          5.7      6.0            5.9            6.0            6.1
5056          7.2      7.1            7.4            6.5            7.0
5057          3.6      4.1            3.0            4.1            5.0
5058          4.7      4.9            5.0            4.1            5.4
5059          2.6      2.2            1.2            2.2            9.0

      rating_class
0             Good
1             Good
2              Bad
3             Good
4             Good
...            ...
5055     Excellent
5056          Good
5057           Bad
5058          Good
5059           Bad

[5060 rows x 23 columns]

In [31]:
# create engine
# engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/movies')

In [32]:
#
# clean_movies.to_sql("moviedata", con = engine)